export const YEARS_LIST = [
  { dateStart: 1980, dateEnd: 1986 },
  { dateStart: 1987, dateEnd: 1991 },
  { dateStart: 1992, dateEnd: 1997 },
  { dateStart: 1999, dateEnd: 2004 },
  { dateStart: 2004, dateEnd: 2012 },
  { dateStart: 2015, dateEnd: 2022 },
];

export const TEXT_FOR_DATE_SLIDES = [
  [
    {
      year: 1980,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1981,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1982,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1983,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1984,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1985,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 1987,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1988,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1989,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1990,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1991,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
  ],

  [
    {
      year: 1992,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1993,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1994,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1995,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1997,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
  ],

  [
    {
      year: 1999,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2000,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 2001,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2002,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2004,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
  ],
  [
    {
      year: 2004,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2005,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 2006,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2010,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2012,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
  ],
  [
    {
      year: 2015,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2016,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 2017,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 2018,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2019,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 2020,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
];
