export const YEARS_LIST = [
  { dateStart: 1980, dateEnd: 1986 },
  { dateStart: 1987, dateEnd: 1991 },
  { dateStart: 1992, dateEnd: 1997 },
  { dateStart: 1999, dateEnd: 2004 },
  { dateStart: 2004, dateEnd: 2012 },
  { dateStart: 2015, dateEnd: 2022 },
];

export const TEXT_FOR_DATE_SLIDES = [
  [
    {
      year: 1980,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1981,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1982,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
    {
      year: 1983,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1984,
      text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
    },
    {
      year: 1985,
      text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
    },
  ],
  [
    {
      year: 1987,
      text: "28 мая — на Красной площади приземлился лёгкий самолёт, которым управлял германский пилот 18-летний Матиас Руст.",
    },
    {
      year: 1988,
      text: "29 мая — визит в СССР Рональда Рейгана, который положил конец холодной войне. ",
    },
    {
      year: 1989,
      text: "Серия акций протеста на площади Тяньаньмэнь в Пекине, продолжавшихся с 15 апреля по 4 июня 1989 года,",
    },
    {
      year: 1990,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1991,
      text: "29 мая — визит в СССР Рональда Рейгана, который положил конец холодной войне.",
    },
  ],

  [
    {
      year: 1992,
      text: "1 января — начало экономической реформы на территории постсоветского пространства, либерализация цен («шоковая терапия»). ",
    },
    {
      year: 1993,
      text: "Внутриполитический конфликт в Российской Федерации 21 сентября",
    },
    {
      year: 1994,
      text: "1 января — начало экономической реформы на территории постсоветского пространства, либерализация цен («шоковая терапия»).",
    },
    {
      year: 1995,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 1997,
      text: "Внутриполитический конфликт в Российской Федерации 21 сентября",
    },
  ],

  [
    {
      year: 1999,
      text: "премьера фильма Никиты Михалкова «Сибирский цирюльник».",
    },
    {
      year: 2000,
      text: "17–20 января — Вторая народная революция на Филиппинах, свержение Джозефа Эстрады.",
    },
    {
      year: 2001,
      text: "премьера фильма Никиты Михалкова «Сибирский цирюльник».",
    },
    {
      year: 2002,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2004,
      text: "Вторая чеченская война: в Грозном сбит вертолёт с военной комиссией Генерального Штаба, погибли 13 человек. ",
    },
  ],
  [
    {
      year: 2004,
      text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
    },
    {
      year: 2005,
      text: "в Иране прошли выборы президента. Главой Ирана стал мэр Тегерана консерватор Махмуд Ахмадинеджад.",
    },
    {
      year: 2006,
      text: "в Санкт-Петербурге состоялся саммит глав стран «Большой восьмёрки». ",
    },
    {
      year: 2010,
      text: "в Санкт-Петербурге состоялся саммит глав стран «Большой восьмёрки». ",
    },
    {
      year: 2012,
      text: "в Санкт-Петербурге состоялся саммит глав стран «Большой восьмёрки». ",
    },
  ],
  [
    {
      year: 2015,
      text: "12 августа в китайском портовом городе Тяньцзинь прогремела серия взрывов на складе химикатов.  ",
    },
    {
      year: 2016,
      text: "В октябре была завершена приватизация «Башнефти» — госокорпорация «Роснефть» приобрела 50,08% акций башкирской компании.",
    },
    {
      year: 2017,
      text: "Инаугурация нового президента США Дональда Трампа. В январе 2017 года он вступил в должность нового главы страны",
    },
    {
      year: 2018,
      text: "15 мая — открытие Крымского моста (для автомобильного движения).",
    },
    {
      year: 2019,
      text: "началась пандемия коронавируса SARS-CoV-2, вызывающего COVID-19.",
    },
    {
      year: 2020,
      text: "Американцы выбирали между представителем Республиканской партии — действующим президентом Дональдом Трампом.",
    },
  ],
];
